SetterApp/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2018-10-19 21:05:50.030257"], ["session_token", "J_Qk7khtdjvBNh4OageLcg"], ["id", 1]]