SetterApp/app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2018-10-19 21:05:50.030257"], ["session_token", "J_Qk7khtdjvBNh4OageLcg"], ["id", 1]]
---
  def reset_session_token!
    self.update!(session_token: self.class.generate_session_token)